{
  "backend/main.mo": "Defines user profiles, posts, comments, conversations, and authorization-backed operations with in-memory storage and admin checks.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files for reference or build planning.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, authentication-gated layout, theme provider, and global toaster.",
  "frontend/src/components/admin/AdminEmployeesSection.tsx": "Admin UI for listing employees and adding new admins with principal validation and loading states.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and reconnection handling.",
  "frontend/src/components/layout/AppShell.tsx": "Top-level layout with navigation, user avatar, logout handling, and responsive header/footer wrapping page content.",
  "frontend/src/components/messages/ConversationThread.tsx": "Renders a chat thread with partner info, message list, auto-scroll, message sending, and refresh control.",
  "frontend/src/components/messages/InboxList.tsx": "Displays a list of conversations with partner profiles, last message preview, timestamps, and loading placeholders.",
  "frontend/src/components/posts/PostComposer.tsx": "Form for creating text or photo posts with validation, upload progress, and Pro-user photo posting restrictions.",
  "frontend/src/components/posts/PostInteractions.tsx": "Handles liking and commenting on posts, toggling comment visibility, and showing comment input and counts.",
  "frontend/src/components/posts/PostList.tsx": "Renders a list of posts with author info, timestamps, content display, and delete support for the author.",
  "frontend/src/components/profile/FollowButton.tsx": "Provides a follow/unfollow button with loading states and mutation handling.",
  "frontend/src/components/profile/PlanStatusCard.tsx": "Shows the user's subscription plan, usage limits, and upgrade option with loading and admin handling.",
  "frontend/src/components/profile/ProfileEditor.tsx": "Allows users to edit profile details and upload a profile photo with validation and progress tracking.",
  "frontend/src/components/profile/ProfileHeader.tsx": "Displays a user's profile info with avatar, bio, location, tags, and follow state handling.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Prompts new users to create their profile via a modal with required fields and validation.",
  "frontend/src/components/system/QueryState.tsx": "Provides reusable loading, error, and empty UI states for data-fetching components.",
  "frontend/src/components/users/UserCard.tsx": "Displays a user profile card with avatar, bio, follower count, and follow/message actions using identity and follower query hooks.",
  "frontend/src/hooks/queryKeys.ts": "Defines stable react-query keys for profiles, follows, posts, messages, discovery, and admin queries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, invalidating and refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, loading stored identities, and handling login states.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for profiles, follows, posts, comments, messages, discovery, and admin actions using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining color themes for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point setting up React, QueryClientProvider, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/ConversationPage.tsx": "Renders a conversation thread with a specific user, ensuring authentication and providing refresh and navigation controls.",
  "frontend/src/pages/DiscoveryPage.tsx": "Shows a searchable list of other users for discovery, filtering results and enforcing authentication.",
  "frontend/src/pages/FeedPage.tsx": "Displays the main feed with post composer, post list, and a manual refresh option, requiring user authentication.",
  "frontend/src/pages/InboxPage.tsx": "Lists all user conversations with refresh capabilities, redirecting unauthenticated users to the home page.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that redirects signed-in users to the feed and displays branding, feature highlights, and a login button.",
  "frontend/src/pages/ProfileMePage.tsx": "User's own profile page with tabs for editing, viewing info, posts, and admin tools; redirects to landing if not authenticated.",
  "frontend/src/pages/ProfileUserPage.tsx": "Displays another user's profile and posts based on principal ID, with navigation back to discovery and auth check.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, shadows, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing current feature set, architecture notes, and versioned requirements for the MeetGae app."
}